#+BEGIN_COMMENT
.. title: Deep N-Grams: Evaluating the Model
.. slug: deep-n-grams-evaluating-the-model
.. date: 2021-01-05 16:48:54 UTC-08:00
.. tags: nlp,n-grams,rnn,gru
.. category: NLP
.. link: 
.. description: Evaluating the GRU model.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-e135270a-ff79-415f-b14f-699cec71cf46-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

*** Pre-Built Model   
   We're going to start with a pre-built file and see how it does relative to our model.

#+begin_src python :results output :exports both
gru = GRUModel()
model = gru.model
pre_built = Path(os.environ["PRE_BUILT_MODEL"]).expanduser()
model.init_from_file(pre_built)
print(model)
#+end_src

#+RESULTS:
: Serial[
:   Serial[
:     ShiftRight(1)
:   ]
:   Embedding_256_512
:   GRU_512
:   GRU_512
:   Dense_256
:   LogSoftmax
: ]

#+begin_src python :results output :exports both
batch = next(training_generator)
preds = model(batch[0])
log_ppx = test_model(preds, batch[1])
print('The log perplexity and perplexity of your model are respectively', log_ppx, numpy.exp(log_ppx))
#+end_src

#+RESULTS:
: The log perplexity and perplexity of your model are respectively 2.0370717 7.6681223

# **Expected Output:** The log perplexity and perplexity of your model are respectively around 1.9 and 7.2.
*** Our Model
#+begin_src python :results output :exports both
gru = GRUModel()
model = gru.model
ours = Path("~/models/gru-shakespeare-model/model.pkl.gz").expanduser()
model.init_from_file(ours)
print(model)
#+end_src

#+RESULTS:
: Serial[
:   Serial[
:     ShiftRight(1)
:   ]
:   Embedding_256_512
:   GRU_512
:   GRU_512
:   Dense_256
:   LogSoftmax
: ]

#+begin_src python :results output :exports both
batch = next(training_generator)
preds = model(batch[0])
log_ppx = test_model(preds, batch[1])
print('The log perplexity and perplexity of your model are respectively', log_ppx, numpy.exp(log_ppx))
#+end_src

#+RESULTS:
: The log perplexity and perplexity of your model are respectively 0.93021315 2.5350494

On the one hand I over-trained my model, on the other hand... why such a big difference?
